zhiqiu-001/tianshu/sdkconfig.defaults.esp32
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions/v1/8m.csv"

CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BLE_MESH_ENABLED=y
CONFIG_BLE_MESH_PROVISIONER=y
CONFIG_BLE_MESH_GATT_PROXY=y
CONFIG_BLE_MESH_RELAY=y
CONFIG_BLE_MESH_FRIEND=y

CONFIG_WIFI_ENABLED=y
CONFIG_ESP_WIFI_STA_AUTO_CONNECT=y

CONFIG_ESP_TASK_WDT_TIMEOUT_S=20
